Ran Plan for project: `staging` dir: `terraform` workspace: `staging`

<details><summary>Show Output</summary>

```diff
+---------+---------------------------------------------------------------------------------------+-----------+---------+
| RESULT  |                                         FILE                                          | NAMESPACE | MESSAGE |
+---------+---------------------------------------------------------------------------------------+-----------+---------+
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/variables.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/versions.tf  | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/backend.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/data.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/main.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/outputs.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/providers.tf | main      | SUCCESS |
+---------+---------------------------------------------------------------------------------------+-----------+---------+

2024-08-29T00:45:09.506Z [INFO]  Terraform version: 1.4.6
2024-08-29T00:45:09.506Z [INFO]  Go runtime version: go1.19.6
2024-08-29T00:45:09.506Z [INFO]  CLI args: []string{"/atlantis-data/bin/terraform1.4.6", "plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-29T00:45:09.599Z [INFO]  CLI command args: []string{"plan", "-input=false", "-refresh", "-out", "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan", "-var-file", "environments/staging.tfvars.json"}
2024-08-29T00:45:09.662Z [INFO]  Testing if Service Principal / Client Certificate is applicable for Authentication..
2024-08-29T00:45:09.699Z [INFO]  Testing if Multi Tenant Service Principal / Client Secret is applicable for Authentication..
2024-08-29T00:45:09.699Z [INFO]  Testing if Service Principal / Client Secret is applicable for Authentication..
2024-08-29T00:45:09.699Z [INFO]  Using Service Principal / Client Secret for Authentication
2024-08-29T00:45:09.699Z [INFO]  Getting OAuth config for endpoint https://login.microsoftonline.com/ with  tenant 4cf7eae5-1a2c-460b-b602-1c4654455f6e
2024-08-29T00:45:18.669Z [INFO]  backend/local: starting Plan operation
2024-08-29T00:45:20.090Z [INFO]  provider: configuring client automatic mTLS
2024-08-29T00:45:20.301Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-29T00:45:20.301Z
2024-08-29T00:45:27.407Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.408Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:27.523Z [INFO]  provider: configuring client automatic mTLS
2024-08-29T00:45:27.801Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-29T00:45:27.801Z
2024-08-29T00:45:35.399Z [INFO]  backend/local: plan calling Plan
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.401Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:35.515Z [INFO]  provider: configuring client automatic mTLS
2024-08-29T00:45:35.706Z [INFO]  provider.terraform-provider-azurerm_v3.116.0_x5: configuring server automatic mTLS: timestamp=2024-08-29T00:45:35.705Z
2024-08-29T00:45:43.208Z [WARN]  ValidateProviderConfig from "provider[\"registry.terraform.io/hashicorp/azurerm\"]" changed the config value, but that value is unused
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "var.postgres"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.207Z [INFO]  ReferenceTransformer: reference not found: "each.value"
data.azurerm_private_dns_zone.default: Reading...
data.azurerm_subnet.default: Reading...
data.azurerm_subnet.delegated: Reading...
2024-08-29T00:45:51.401Z [WARN]  Provider "registry.terraform.io/hashicorp/azurerm" produced an invalid plan for module.postgresql.azurerm_postgresql_flexible_server.default["backstage-demo"], but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .geo_redundant_backup_enabled: planned value cty.False for a non-computed attribute
      - .auto_grow_enabled: planned value cty.False for a non-computed attribute
      - .authentication: attribute representing nested block must not be unknown itself; set nested attribute values to unknown instead
2024-08-29T00:45:51.403Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-29T00:45:51.403Z [INFO]  ReferenceTransformer: reference not found: "local.database"
2024-08-29T00:45:51.403Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.403Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.403Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.403Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-29T00:45:51.403Z [INFO]  ReferenceTransformer: reference not found: "var.postgres"
2024-08-29T00:45:51.502Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-29T00:45:51.502Z [INFO]  ReferenceTransformer: reference not found: "var.postgres"
2024-08-29T00:45:51.502Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:51.502Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default"
2024-08-29T00:45:51.502Z [INFO]  ReferenceTransformer: reference not found: "each.key"
data.azurerm_subnet.default: Read complete after 1s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/virtualNetworks/vnet-demo/subnets/subnet-app]
data.azurerm_private_dns_zone.default: Read complete after 1s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]
data.azurerm_subnet.delegated: Read complete after 1s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/virtualNetworks/vnet-demo/subnets/subnet-pg-delegated]
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.key"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-29T00:45:52.103Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-29T00:45:52.104Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.104Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.104Z [INFO]  ReferenceTransformer: reference not found: "each.value"
2024-08-29T00:45:52.104Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-29T00:45:52.104Z [INFO]  ReferenceTransformer: reference not found: "azurerm_postgresql_flexible_server.default#destroy"
2024-08-29T00:45:52.106Z [INFO]  backend/local: plan operation completed
2024-08-29T00:45:52.106Z [INFO]  backend/local: writing plan output to: /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.postgresql.azurerm_postgresql_flexible_server.default["backstage-demo"] will be created
+ resource "azurerm_postgresql_flexible_server" "default" {
+       administrator_login           = "psqladmin"
+       administrator_password        = (sensitive value)
+       auto_grow_enabled             = false
+       backup_retention_days         = (known after apply)
+       fqdn                          = (known after apply)
+       geo_redundant_backup_enabled  = false
+       id                            = (known after apply)
+       location                      = "eastus2"
+       name                          = "backstage-demo"
+       private_dns_zone_id           = (known after apply)
+       public_network_access_enabled = true
+       resource_group_name           = "my-rg"
+       sku_name                      = "GP_Standard_D2s_v3"
+       storage_mb                    = 32768
+       storage_tier                  = "P30"
+       tags                          = {
+           "terraform" = "true"
        }
+       version                       = "14"
+       zone                          = "1"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.default["backstage-demo"] will be created
+ resource "azurerm_postgresql_flexible_server_configuration" "default" {
+       id        = (known after apply)
+       name      = "azure.extensions"
+       server_id = (known after apply)
+       value     = "CUBE,CITEXT,BTREE_GIST"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.default["backstage"] will be created
+ resource "azurerm_postgresql_flexible_server_database" "default" {
+       charset   = "UTF8"
+       collation = "en_US.utf8"
+       id        = (known after apply)
+       name      = "backstage"
+       server_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ pgsq_fqdn                          = (known after apply)
+ pgsq_id                            = (known after apply)

2024-08-29T00:45:54Z INFO Autodetected 1 Terraform plan binary file project across 1 root module
2024-08-29T00:45:54Z INFO Found Terraform plan binary file project "-atlantis-data-repos-leandromoreirati-backstage-demo-1-staging-terraform-staging-staging.tfplan" at directory "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.tfplan"



Update: A new version of Infracost is available: v0.10.37 → v0.10.38
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh

Update: A new version of Infracost is available: v0.10.37 → v0.10.38
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://172.214.119.134/lock?id=leandromoreirati%252Fbackstage-demo%252Fterraform%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```